Experiment Results/yugabyte results logs/yugabyte_tservers_3/pgbench_t100.log
pgbench -h 127.0.0.1 -p 5433 -U yugabyte -d demo -c 200 -j 8 -t 100 -M prepared -n -f ../workloads/read50_write50.sql --max-tries=5
pgbench (17.4, server 15.12-YB-2.25.2.0-b0)
transaction type: ../workloads/read50_write50.sql
scaling factor: 1
query mode: prepared
number of clients: 200
number of threads: 8
maximum number of tries: 5
number of transactions per client: 100
number of transactions actually processed: 20000/20000
number of failed transactions: 0 (0.000%)
number of transactions retried: 0 (0.000%)
total number of retries: 0
latency average = 277.179 ms
initial connection time = 1166.528 ms
tps = 721.554942 (without initial connection time)